app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("first_name", "last_name", "phonenumber", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Barry"], ["last_name", "Haney"], ["phonenumber", "+264-73-4238822"], ["created_at", "2018-09-20 14:49:16.925639"], ["updated_at", "2018-09-20 14:49:16.925639"], ["user_id", 5]]
---
  def create
    @contact = current_user.contacts.build(contact_params)
    if @contact.save