app/controllers/sms_sends_controller.rb

  def new
    @at = SmsSend.new
    @contact = Contact.find_by(id: params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @at = SmsSend.create(sms_params)
    if @at.save!
      @con = current_user.contacts.find_by(id: @at.contact_id)
      AfricasTalkingGateway.new("trial-error", "29f7557bfacfe4335ea850fc3fe258b7f70064d069a014e39d5d2eece16659a9").sendMessage(@con.phonenumber, @at.message)
      redirect_to contacts_path
      flash[:success] = "Message Successfully sent to #{@con.first_name}!"
---
INSERT INTO "sms_sends" ("message", "mobile", "created_at", "updated_at", "contact_id") VALUES (?, ?, ?, ?, ?)  [["message", "iii"], ["mobile", ""], ["created_at", "2018-09-21 12:10:01.834546"], ["updated_at", "2018-09-21 12:10:01.834546"], ["contact_id", 1]]
INSERT INTO "sms_sends" ("message", "created_at", "updated_at", "contact_id") VALUES (?, ?, ?, ?)  [["message", "jsuis sdugsdu"], ["created_at", "2018-09-21 12:49:22.135969"], ["updated_at", "2018-09-21 12:49:22.135969"], ["contact_id", 1]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ? AND "contacts"."id" = ? LIMIT ?  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ?  [["user_id", 1]]

  def new_all
    @at = SmsSend.new
    @contact = Contact.find_by(id: params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create_all
    @at = SmsSend.create(sms_params)
    if @at.save!
      current_user.contacts.each do |c|
---
INSERT INTO "sms_sends" ("message", "created_at", "updated_at") VALUES (?, ?, ?)  [["message", ""], ["created_at", "2018-09-22 09:58:13.752925"], ["updated_at", "2018-09-22 09:58:13.752925"]]
SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = ?  [["user_id", 1]]